import styles from './CookiesPolicy.module.css';

export default function CookiesPolicy() {
  return (
    <section className={styles.сookiesPolicySection}>
      <div className={styles.container}>

        <p className={styles.paragraph}>УТВЕРЖДЕНО<br />
        приказ директора Частного предприятия «Агентство АС недвижимости»<br />
        от ______________ г. № ___</p>

        <h1 className={styles.heading1}>
          ПОЛОЖЕНИЕ<br />
          о политике в отношении обработки cookies
        </h1>

        <h2 className={styles.heading2}>1. Что такое cookies</h2>
        <p className={styles.paragraph}>
          Файлы cookies являются текстовым файлом, сохраненным в браузере компьютера (мобильного устройства) пользователя официального интернет-сайта https://asrealt.by Частного предприятия «Агентство АС недвижимости» (далее – сайт) при его посещении для отражения совершенных действий. Этот файл позволяет не вводить заново или выбирать те же параметры при повторном посещении сайта, например, выбор языковой версии.<br />
          Целью обработки cookies является обеспечение удобства пользователей сайта и повышение качества его функционирования.<br />
          Частное предприятие «Агентство АС недвижимости» не использует cookies для идентификации конкретных субъектов персональных данных.
        </p>

        <h2 className={styles.heading2}>2. Какие cookies мы используем</h2>
        <p className={styles.paragraph}>
          На сайте обрабатываются следующие типы cookies:
        </p>
        <ul className={styles.list}>
          <li>аналитические – позволяют собирать обезличенные статистические данные о характеристиках пользовательских устройств и способах взаимодействия с сайтом. Позволяют подсчитывать количество и длительность посещений сайта, анализировать использование пользователем сайта, определять наиболее и (или) наименее популярные страницы сайта, что помогает улучшать производительность сайта и делать его более удобным для использования. Для обработки аналитических файлов cookies используются сервисы Google Analytics, Яндекс.Метрика, которые используют анонимные идентификаторы браузеров, которые сохраняются в cookies;</li>
          <li>рекламные – используются для улучшения качества рекламы, предоставления релевантного контента и персонализированной рекламы. Для обработки рекламных файлов cookies используются сервисы Google Analytics, Яндекс.Метрика;</li>
          <li>технические (обязательные) – необходимы для обеспечения правильного функционирования сайта, корректного использования предлагаемых на нем возможностей и услуг.</li>
        </ul>

        <h2 className={styles.heading2}>3. Хранение cookies</h2>
        <p className={styles.paragraph}>
          В зависимости от сроков хранения в браузере устройства пользователя сайта используются сеансовые и постоянные файлы cookies. Сеансовые файлы cookies хранятся только во время пользования сайтом, а постоянные – в течение времени, указанного в параметрах файлов cookies, или до момента их удаления пользователем.
        </p>

        <h2 className={styles.heading2}>4. Приложение с описанием cookies</h2>
        <p className={styles.paragraph}>
          Список обрабатываемых на сайте файлов cookies с их описанием и сроками хранения указан в приложении к настоящей политике.
        </p>

        <h2 className={styles.heading2}>5. Передача cookies третьим лицам</h2>
        <p className={styles.paragraph}>
          Оператор использует следующие аналитические сервисы:<br /><br />
          «Яндекс.Метрика» – сервис веб-аналитики, предоставляемый ООО «Яндекс». Адрес: г. Москва, ул. Льва Толстого, д. 16, 119021 (Политика конфиденциальности);<br />
          «Google Analytics» – сервис веб-аналитики, предоставляемый компанией Google, Inc. Адрес: Google, Google Data Protection Office, 1600 Amphitheatre Pkwy, Mountain View, CA 94043, USA (Политика конфиденциальности);<br />
          «Google Tag Manager» – система управления тегами, предоставляемая компанией Google, Inc. Адрес: Google, Google Data Protection Office, 1600 Amphitheatre Pkwy, Mountain View, CA 94043, USA (Политика конфиденциальности);<br />
          «Meta Pixel» — инструмент аналитики для измерения результативности рекламы, предоставляется Meta Platforms, Inc. (до 28 октября 2021 года — Facebook Inc.) (Политика конфиденциальности).<br /><br />
          Таким образом, компании Яндекс, Google, Meta (ранее Facebook), обрабатывают информацию о посещении пользователями сайта и действиях, которые пользователи совершают на страницах сайта.<br /><br />
          Вероятно, серверы некоторых из указанных компаний могут находиться на территории Европы, а также в Северной и(или) Южной Америке, Азии, т.е. на территории, на которой не обеспечивается надлежащий уровень защиты прав субъектов персональных данных. В связи с этим возможны такие риски, как: может отсутствовать единое правовое регулирование защиты персональных данных, может быть узкое понимание персональных данных (отнесение к ним ограниченного круга сведений о физическом лице), может отсутствовать независимый контролирующий орган по защите прав субъектов персональных данных, может быть ограниченный круг (отсутствие) прав субъектов персональных данных, широкий доступ к персональным данным у органов государственной власти в целях национальной безопасности и(или) третьих лиц, в результате чего персональные данные могут стать доступными неограниченному кругу лиц и иные подобные риски.
        </p>

        <h2 className={styles.heading2}>6. Принятие или отклонение cookies</h2>
        <p className={styles.paragraph}>
          Пользователи могут принять или отклонить все обрабатываемые на сайте cookies, кроме технических.<br />
          Отключение статистических cookies не позволяет определять предпочтения пользователей сайта, в том числе наиболее и наименее популярные страницы и принимать меры по совершенствованию работы сайта исходя из предпочтений пользователей.
        </p>

        <h2 className={styles.heading2}>7. Срок действия согласия</h2>
        <p className={styles.paragraph}>
          По окончании сроков хранения cookies сайт Частного предприятия «Агентство АС недвижимости» снова запросит ваше согласие.<br />
          Вместе с тем пользователи вправе изменить свой выбор настроек cookies (в том числе отозвать согласие) в любое время в интерфейсе сайта, например, осуществив переход по ссылке в нижней части страницы сайта ”Выбор настроек cookies“ (нужно предусмотреть!) и сохранив настройки.
        </p>

        <h2 className={styles.heading2}>8. Управление cookies в браузере</h2>
        <p className={styles.paragraph}>
          Помимо настроек cookies на сайте субъекты персональных данных могут принять или отклонить сбор всех или некоторых cookies в настройках своего браузера.<br />
          При этом некоторые браузеры позволяют посещать интернет-сайты в режиме ”инкогнито“, чтобы ограничить хранимый на компьютере объем информации и автоматически удалять сессионные cookies. Кроме того, субъект персональных данных может удалить ранее сохраненные cookies выбрав соответствующую опцию в истории браузера.
        </p>

        <h2 className={styles.heading2}>Приложение: список используемых файлов cookies</h2>
        <p className={styles.paragraph}>
          Название — Описание — Тип — Срок хранения:<br /><br />
          _ga, _ga_* — Google Analytics, просмотры страниц — Аналитические — 24 месяца<br />
          _gid — Google Analytics, просмотры страниц — Аналитические — 1 день<br />
          _gcl_* — Google Tag Manager/Analytics, сервисные запросы — Аналитические — 1 минута<br />
          _ym_isad — Яндекс.Метрика, просмотры страниц — Аналитические — 2 дня<br />
          _ym_d — Яндекс.Метрика, дата первого посещения — Аналитические — 12 месяцев<br />
          _ym_uid — Яндекс.Метрика, уникальный ID — Аналитические — 12 месяцев<br />
          _ym_visorc — Яндекс.Метрика, работа вебвизора — Аналитические — 30 минут<br />
          _yasc — Яндекс.Метрика, источники трафика — Аналитические — 12 месяцев<br />
          yashr — Яндекс.Метрика, вспомогательная информация — Аналитические — 12 месяцев<br />
          _gcl_au — Google Ads/Поисковая реклама — Рекламные — 3 месяца<br />
          _fbp — Facebook Ads — Рекламные — 1 день<br />
          _tt_enable_cookie — TikTok Ads — Рекламные — 13 месяцев<br />
          _ttp — TikTok, эффективность рекламы — Рекламные — 13 месяцев<br />
          PHPSESSID — ID сессии — Технические — Сессионные<br />
          BITRIX_SM_* — CMS Bitrix: баннеры, логин и т.д. — Аналитические — 24 часа<br />
          *_ct_ref_c — источник перехода — Аналитические — 24 часа<br />
          marquiz__url_params — Marquiz, UTM — Аналитические — 3 месяца<br />
          marquiz__count-opened_* — Marquiz, количество открытий — Аналитические — 3 месяца<br />
          cookiesUser — Настройки cookies — Технические — 12 дней
        </p>

      </div>
    </section>
  );
}
